package models

import (
	"github.com/jinzhu/gorm"
	_ "github.com/lib/pq"
	_ "github.com/go-sql-driver/mysql"
	_ "github.com/mattn/go-sqlite3"
	"fmt"
)

func NewDB(dbType, conn string) gorm.DB {
	db, err := gorm.Open(dbType, conn)
	if err != nil {
		fmt.Println("DB Connection Error!!!")
	}
	defer db.Close()

	err = db.DB().Ping()
	if err != nil {
		fmt.Println("DB Connection Ping Error!!!")
	}
	fmt.Println("DB Connection OK!")
	db.SingularTable(true)
	db.DropTable(&Content{})
	db.CreateTable(&Content{})
	contents := Setup()
	for _, c := range contents {
		db.Create(&c)
	}
	return db
}

type Content struct {
	gorm.Model
	Name string
	Body string `sql: "type:text"`
}

func Setup() ([]*Content) {
	c := make([]*Content, 2)
	c[0] = &Content{
		Name: "ข่าวประจำวัน",
		Body: `วันที่ 20 ก.พ.59 นายพาที สารสิน ประธานเจ้าหน้าที่บริหาร สายการบินนกแอร์ เปิดเผยถึงกรณีประกาศยกเลิก 20 เที่ยวบินในวันที่ 23 ก.พ.นี้ ผ่านเฟซบุ๊คของสายการบินนกแอร์ ระบุว่า สำหรับการยกเลิกเที่ยวบินครั้งนี้ นกแอร์ได้มีพันธมิตรรองรับผู้โดยสารที่จะเดินทางตามเที่ยวบินที่ยกเลิกไว้แล้ว ขอให้ผู้โดยสารไม่ต้องกังวล และสามารถติดต่อไปตามช่องทางที่นกแอร์แจ้งไว้ เช่นเดียวกับฝ่ายประชาสัมพันธ์ สายการบินนกแอร์ ที่ระบุว่า หลังจากนี้จะมีการแจ้งข่าวสารผ่านช่องทางสังคมออนไลน์หากมีอะไรคืบหน้า โดยผู้โดยสารสามารถติดต่อตรงได้กับเจ้าหน้าที่นกแอร์ตามช่องทางที่ระบุไว้ Call Center 1318

          ทั้งนี้ เที่ยวบินที่มีประกาศยกเลิกในวันที่ 23 ก.พ.2559 จำนวน 20 เที่ยวบิน ประกอบไปด้วย DD7106 ดอนเมือง-หาดใหญ่ , DD7107 หาดใหญ่-ดอนเมือง , DD7818 ดอนเมือง-นครศรีธรรมราช, DD7819 นครศรีธรรมราช-ดอนเมือง , DD7208 ดอนเมือง-สุราษฎร์ธานี , DD7209 สุราษฎร์ธานี-ดอนเมือง , DD7406 ดอนเมือง-ตรัง , DD7407 ตรัง-ดอนเมือง , DD8414 ดอนเมือง-พิษณุโลก , DD8415 พิษณุโลก-ดอนเมือง , DD8718 ดอนเมือง-เชียงราย , DD8719 เชียงราย-ดอนเมือง , DD9214 ดอนเมือง-อุดรธานี , DD9215 อุดรธานี-ดอนเมือง , DD9314 ดอนเมือง-อุบลราชธานี , DD9315 อุบลราชธานี-ดอนเมือง , DD9410 ดอนเมือง-สกลนคร , DD9411 สกลนคร-ดอนเมือง , DD9814 ดอนเมือง-ขอนแก่น , DD9815 ขอนแก่น-ดอนเมือง

          แหล่งข่าวจากสายการบินนกแอร์ กล่าวว่า จากกรณียกเลิกเที่ยวบินครั้งนี้เกิดจากทางสายการบินอยู่ระหว่างแก้ไขปัญหาภายในองค์กร ซึ่งจะมีการปรับเที่ยวบินให้สอดคล้องกับจำนวนนักบิน และศักยภาพของสายการบิน จึงอาจทำให้มีการยกเลิกเที่ยวบิน รวมทั้งเลื่อนตารางบินบ้างในบางวัน ถือเป็นเรื่องปกติของการทำธุรกิจการบิน

          อย่างไรก็ดี ขอยืนยันว่านกแอร์ได้ดูแลผู้โดยสารที่ได้รับความเดือดร้อนตามกรอบที่กรมการบินพลเรือน (บพ.) กำหนดอย่างเช่นที่ผ่านมา อาทิ เงินชดเชย โรงแรมที่พัก รวมไปถึงการส่งต่อผู้โดยสารไปยังสายการบินอื่น แต่การชี้แจงผ่านโซเชียลมีเดียเป็นเพียงช่องทางที่นกแอร์ต้องการสื่อสารให้ผู้โดยสารรับทราบทุกท่านเท่านั้น
          `,
	}
	return c
}